import IdToLecture from '../data/id_to_lecture.json';
import SectionStructure from '../data/section_structure.json';

export const ACADEMIC_FIELDS = [
  "情報学基礎",
  "計算基盤",
  "人間情報学",
  "情報学フロンティア",
  "地球環境学",
  "環境解析学",
  "環境保全学",
  "環境創成学",
  "デザイン学",
  "生活科学",
  "科学教育・教育工学",
  "科学社会学・科学技術史",
  "文化財科学・博物館学",
  "地理学",
  "社会・安全システム科学",
  "人間医工学",
  "健康・スポーツ科学",
  "子ども学",
  "エネルギー科学",
  "生体分子科学",
  "脳科学",
  "地域研究",
  "ジェンダー",
  "観光学",
  "哲学",
  "芸術学",
  "文学",
  "言語学",
  "史学",
  "人文地理学",
  "文化人類学",
  "法学",
  "政治学",
  "経済学",
  "経営学",
  "社会学",
  "心理学",
  "教育学",
  "外国語",
  "スポーツ実習",
  "ILASセミナー（教養・共通教育）",
  "ナノ･マイクロ科学",
  "応用物理学",
  "量子ビーム科学",
  "計算科学",
  "数学",
  "天文学",
  "物理学",
  "地球惑星科学",
  "プラズマ科学",
  "基礎化学",
  "複合化学",
  "材料化学",
  "神経科学",
  "実験動物学",
  "腫瘍学",
  "ゲノム科学",
  "生物資源保全学",
  "生物科学",
  "基礎生物学",
  "人類学",
  "機械工学",
  "電気電子工学",
  "土木工学",
  "建築学",
  "材料工学",
  "プロセス・化学工学",
  "総合工学",
  "生産環境農学",
  "農芸化学",
  "森林圏科学",
  "水圏応用科学",
  "社会経済農学",
  "農業工学",
  "動物生産化学",
  "境界農学",
  "薬学",
  "基礎医学",
  "臨床医学",
  "境界医学",
  "社会医学",
  "内科系臨床医学",
  "外科系臨床医学",
  "歯学",
  "看護学",
  "総合生存学",
];

export const CLASS_TYPES = [
  "講義",
  "演習",
  "実習",
  "実験",
  "フィールドワーク",
  "卒業研究等",
  "その他",
];

export const DEPARTMENTS = [
  "全学共通科目",
  "文学部",
  "教育学部",
  "法学部",
  "経済学部",
  "理学部",
  "薬学部",
  "工学部",
  "農学部",
  "総合人間学部",
];

export const EMPTY_OPTION = "----";

export const LANGUAGES = [
  "日本語",
  "英語",
  "バイリンガル",
  "その他",
];

export const LEVELS = [
  "導入的な内容の科目（学部科目）",
  "基礎的な内容の科目（学部科目）",
  "発展的な内容の科目（学部科目）",
  "卒業論文・卒業研究関連の科目（学部科目）",
  "基礎的な内容の科目（大学院科目）",
  "発展的な内容の科目・研究指導科目（大学院科目）",
  "応用的な内容の科目・研究指導科目（大学院科目）",
  "大学院共通内容の科目（大学院科目）",
  "学部・大学院合同で開講する科目等",
];

export const SEMESTERS = ["前期", "後期", "通年", "前期集中", "後期集中", "通年集中"];

// JSONファイルから直接データを読み込む
export const SECTION_STRUCTURE = SectionStructure;
export const ID_TO_LECTURE = IdToLecture;

// 学部ごとの学科マッピング
export const MAJORS_BY_DEPARTMENT: Record<string, string[]> = {
  "経済学部": ["経済学科", "経営学科"],
  "工学部": ["地球工学科", "建築学科", "物理工学科", "電気電子工学科", "情報学科", "工業化学科"],
  "理学部": ["理学科"],
  "文学部": ["人文学科"],
  "法学部": ["法学科"],
  "農学部": ["資源生物科学科", "応用生命科学科", "地域環境工学科", "食料・環境経済学科", "森林科学科", "食品生物科学科"],
  "薬学部": ["薬科学科", "薬学科"],
  "教育学部": ["教育科学科"],
  "総合人間学部": ["総合人間学科"]
};
